# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import random
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [5]:
series1 = pd.Series(np.random.randint(1,5,size=100))
series2 = pd.Series(np.random.randint(1,4,size=100))
series3 = pd.Series(np.random.randint(10000,30000,size=100))

0     17278
1     14372
2     18583
3     18039
4     22856
      ...
95    19038
96    17664
97    17697
98    10516
99    28332
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [8]:
dataframe = pd.concat([series1,series2,series3],axis =1)
dataframe.head()

   0  1      2
0  1  1  17278
1  2  2  14372
2  1  1  18583
3  1  3  18039
4  2  3  22856

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [14]:
dataframe.columns = ['bedrs','bathrs','price_sqr_meter']
dataframe

    bedrs  bathrs  price_sqr_meter
0       1       1            17278
1       2       2            14372
2       1       1            18583
3       1       3            18039
4       2       3            22856
..    ...     ...              ...
95      1       3            19038
96      4       3            17664
97      4       2            17697
98      2       1            10516
99      2       2            28332

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [16]:
bigcolumn = pd.concat([series1,series2,series3])
bigcolumn = bigcolumn.to_

0         1
1         2
2         1
3         1
4         2
      ...
95    19038
96    17664
97    17697
98    10516
99    28332
Length: 300, dtype: int32

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [17]:
dataframe.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [27]:
dataframe.index = range(0,300)
dataframe.index

RangeIndex(start=0, stop=300, step=1)